cracking-the-coding-interview/1.6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cracking the Coding Interviews-Q1.6</title>
<!-- 2014-11-30 日 21:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="马楠（nxmanan#gmail.com）" />
<meta  name="description" content="Cracking the Coding Interview笔记"
 />
<meta  name="keywords" content="Algorithm" />
<link rel="stylesheet" type="text/css" href="../style/emacs.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./interview-questions.html"> UP </a>
 |
 <a accesskey="H" href="http://wiki.manan.org"> HOME </a>
</div><div id="content">
<h1 class="title">Cracking the Coding Interviews-Q1.6</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">题目</a>
<ul>
<li><a href="#sec-1-1">原文</a></li>
</ul>
</li>
<li><a href="#sec-2">译文</a></li>
<li><a href="#sec-3">解答</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">题目</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">原文</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Given an image represented by an NxN matrix, where each pixel in the image is 4 bytes, write a method to rotate the image by 90 degrees. Can you do this in place?
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">译文</h2>
<div class="outline-text-2" id="text-2">
<p>
给定一个用NxN矩阵表示的图片，图中每个像素用4字节表示。写一个方法实现旋转图片90度。你能原地实现吗？
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">解答</h2>
<div class="outline-text-2" id="text-3">
<p>
我的思路是对方阵的每一圈分别进行旋转。旋转的关键是写出旋转前后对应点的坐标，代码如下。
</p>
<div class="org-src-container">

<pre class="src src-cpp">void rotate(int **array, int n) {
  //外层循环依次从外到内处理每一圈
  for ( int curSize = n; curSize &gt; 1; curSize -= 2) {
  //内层循环处理当前圈中所有要旋转的点
    for (int ind = 0; ind &lt; curSize - 1; ind++) {
      int curCircle = (n - curSize) / 2;
      int tmp = array[curCircle][ind + curCircle];  //top
      array[curCircle][ind + curCircle] =
          array[n - 1 - curCircle + ind][curCircle]; //left
      array[n - 1 - curCircle + ind][curCircle] =
          array[n - 1 - curCircle][n - 1 - curCircle - ind]; //bottom;
      array[n - 1 - curCircle][n - 1 - curCircle - ind] =
          array[curCircle + ind][n - 1 -curCircle];  //right
      array[curCircle + ind][n - 1 -curCircle] = tmp;
    }
  }
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2014-11-30</p>
<p class="author">Author: 马楠（nxmanan#gmail.com）</p>
<p class="date">Created: 2014-11-30 日 21:26</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
